Equipo KND:
EXPERIENCIA DEL AxoRallY:

CAPITAN_Bryan:
Estuvo chido el evento y fue interesante.
-----------------------------------------------
Participante Eulogio:
Todo chido y interesante y estresante.
-----------------------------------------------
Participante Isai:
El concurso estuvo bonito, me diverti, aprendi un nuevo curso de programacion en menos de media hora, ahora me llevo esta experiencia para futuros eventos.
-----------------------------------------------
Participante Brendiux:
Fue un evento muy largo, pero me llevo la experiencia de algo nuevo.
-----------------------------------------------
Participante Leonardo:
Estuvo chido y aprendi a descifrar lo que queria.CREATE DATABASE KND;

CREATE TABLE tareas(
id int primary key auto_increment,
titulo_tarea varchar(30),
descripcion varchar(50),
fecha_de_creacion date,
estado varchar(50),

foreign key (titulo_tarea) references etiquetas(Nombre_Etiqueta)
);

create table etiquetas(
ide int,
Nombre_etiqueta varchar(20) primary key,
etiquetado varchar(30)
);

create table usuario(
folio int primary key,
nombre varchar(50),
pass varchar(10));

insert into etiquetas(ide, Nombre_etiqueta, etiquetado) values(2, 'pintar', 'DOMINGO');
insert into etiquetas(ide, Nombre_etiqueta, etiquetado) values(1, 'barrer', 'SABADO-DOMINGO');

INSERT INTO usuario(folio, nombre, pass) values(

insert into tareas(titulo_tarea, descripcion, fecha_de_creacion, estado) values( 'pintar', 'pintar la casa', '2000-08-23', "completada");
insert into tareas(titulo_tarea, descripcion, fecha_de_creacion, estado) values( 'pintar', 'pintar la casa', '2000-08-23', "completada");
insert into tareas(titulo_tarea, descripcion, fecha_de_creacion, estado) values( 'pintar', 'pintar la casa', '2000-08-23', "completada");


#include <stdio.h>
#include <conio.h>
//KND
int main(){
	int lapiz[10], n, k,i,contador;

   printf("ingrese el numero de lapices;");
   scanf("%i",&n);

   printf("\n");

   for(i=0;i<n;i++){
   	scanf("%i",&lapiz[i]);
   }

   for(i=0;i<n;i++){third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
If you require further assistance please contact us by sending email to
export@cisco.com.
cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
Processor board ID FOC1010X104
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.
64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:0C:85:A9:56:93
Motherboard assembly number     : 73-10390-03
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC10093R12
Power supply serial number      : AZS1007032H
Model revision number           : B0
Motherboard revision number     : B0
Model number                    : WS-C2960-24TT-L
System serial number            : FOC1010X104
Top Assembly Part Number        : 800-27221-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COM3L00BRA
Hardware Board Revision Number  : 0x01

Switch Ports Model              SW Version            SW Image
------ ----- -----              ----------            ----------
*    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M

Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 02:49 by mnguyen



Press RETURN to get started!



Switch>en
Switch#con terminal
% Ambiguous command: "con terminal"
Switch#conf terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name VLAN_10
Switch(config-vlan)#ex
Switch(config)#vlan 20
Switch(config-vlan)#name VLAN_20
Switch(config-vlan)#ex
Switch(config)#vlan 30
Switch(config-vlan)#name VLAN_30
Switch(config-vlan)#ex
Switch(config)#ex
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#
Switch#en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface range fa0/1-5
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 10
Switch(config-if-range)#ex
Switch(config)#interface range fa0/6-12
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 20
Switch(config-if-range)#ex
Switch(config)#interface range fa0/13-24
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 30
Switch(config-if-range)#ex
Switch(config)#ex
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#ex









Switch con0 is now available






Press RETURN to get started.













Switch>show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gig0/1, Gig0/2
10   VLAN_10                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5
20   VLAN_20                          active    Fa0/6, Fa0/7, Fa0/8, Fa0/9
                                                Fa0/10, Fa0/11, Fa0/12
30   VLAN_30                          active    Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch>
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/6, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/6, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/13, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/13, changed state to up

%LINK-3-UPDOWN: Interface FastEthernet0/13, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/13, changed state to down

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface range fast0/1-5
Switch(config-if-range)#ip address 192.168.0.1 255.255.255.0
                            ^
% Invalid input detected at '^' marker.
	
Switch(config-if-range)#ex
Switch(config)#interface vlan 10
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up
ex
Switch(config)#ex
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface vlan_10
                             ^
% Invalid input detected at '^' marker.
	
Switch(config)#interface VLAN_10<html>
<head>
  <title>
    Nombre del usuario
  </title> 
  
  <center><h1>Nombre del usuario : isai martinez najera</h1>

    <img src="D:\ISAI NAJERA\Escritorio\1.jpeg" width="300" height="400">
    
    </center>
</head>



<body>
<H2>Informacion personal</H2>
<p>Edad:25</p>
<p>Ubicacion: En la escuela</p>
<p>Ocupacion:Aprendiendo HTML</p>

<H2>Habilidades</H2>
<ul>
    <li><p>programando</p></li>
    <li><p>comer</p></li>
    <li><p>Jugar</p></li>
    <li><p>Estudiar</p></li>
   
</ul>

<H2>Experiencia</H2>
<ul>
    <li><p>Microsoft</p></li>
    <li><p>Apple</p></li>
    <li><p>IBM</p></li>
    <li><p>TEC</p></li>
   
</ul>

<H2>Educacion</H2>
<ul>
    <li><p>Kinder</p></li>
    <li><p>Primari</p></li>
    <li><p>Secundario</p></li>
    <li><p>Preparatoria</p></li>
    <li><p>Universidad</p></li>
   
</ul>

<footer>

<section>

    isainaxera@gmail.com

</section>


</footer>

</body>
</html>




</html>
                             ^
% Invalid input detected at '^' marker.
	
Switch(config)#interface VLAN 10
Switch(config-if)#ip address 192.168.0.0 255.255.255.0
Bad mask /24 for address 192.168.0.0
Switch(config-if)#no shutdown
Switch(config-if)#ex
Switch(config)#ip default 192.168.0.0
Switch(config)#interface VLAN 20
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up

Switch(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up
   	printf("%i\t",lapiz[i]);
   }


   printf("\n\nNumero de lapiz:");
   scanf("%i",&k);

   for(i=0;i<=n;i++){
   	if(k==lapiz[i]){
      		contador++;
          }

   }

   printf("\n\nHay %i lapices del numero %i",contador,k);
   getche();
}
select * from tareas where estado='pendiente';

select * from tareas where fecha_de_creacion between '2000-08-22' and '2000-08-26';

select * from KND.etiquetas join KND.tareas on KND.etiquetas.Nombre_etiqueta = KND.tareas.titulo_tarea;

select count(*) FROM tareas where estado='completada';

select count(*) FROM tareas where estado='pendiente';

select count(*) FROM tareas where estado='en progreso';
